spec/cassettes/StripeWrapper/StripeWrapper_Customer/_retrieve/get_the_list_of_subscripton_data.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=1&card[exp_year]=2015&card[cvc]=314
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.9.9
      Authorization:
      - Bearer sk_test_e2Jyqc84D52dW381fNpkCo4i
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.9.9","lang":"ruby","lang_version":"2.0.0 p353 (2013-11-22)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19 22:22:27
        PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 17 Feb 2014 04:26:49 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '570'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_103VkU225BGP9bWCK71ajV92",
          "livemode": false,
          "created": 1392611209,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_103VkU225BGP9bWCrCY5I1FV",
            "object": "card",
            "last4": "4242",
            "type": "Visa",
            "exp_month": 1,
            "exp_year": 2015,
            "fingerprint": "9ejOe3jqfcNEBbko",
            "customer": null,
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null
          }
        }
    http_version: 
  recorded_at: Mon, 17 Feb 2014 04:26:49 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card=tok_103VkU225BGP9bWCK71ajV92&plan=myflix_base&email=virgil_huel%40klein.com
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.9.9
      Authorization:
      - Bearer sk_test_e2Jyqc84D52dW381fNpkCo4i
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.9.9","lang":"ruby","lang_version":"2.0.0 p353 (2013-11-22)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19 22:22:27
        PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '80'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 17 Feb 2014 04:26:50 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2847'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1392611210,
          "id": "cus_3VkUGLUbX7ANH5",
          "livemode": false,
          "description": null,
          "email": "virgil_huel@klein.com",
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "count": 1,
            "url": "/v1/customers/cus_3VkUGLUbX7ANH5/subscriptions",
            "data": [
              {
                "id": "sub_3VkUMBG5GJ3uvY",
                "plan": {
                  "interval": "month",
                  "name": "myflix_base_plan",
                  "created": 1392312654,
                  "amount": 999,
                  "currency": "usd",
                  "id": "myflix_base",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {}
                },
                "object": "subscription",
                "start": 1392611210,
                "status": "active",
                "customer": "cus_3VkUGLUbX7ANH5",
                "cancel_at_period_end": false,
                "current_period_start": 1392611210,
                "current_period_end": 1395030410,
                "ended_at": null,
                "trial_start": null,
                "trial_end": null,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null
              }
            ]
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "cards": {
            "object": "list",
            "count": 1,
            "url": "/v1/customers/cus_3VkUGLUbX7ANH5/cards",
            "data": [
              {
                "id": "card_103VkU225BGP9bWCrCY5I1FV",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 1,
                "exp_year": 2015,
                "fingerprint": "9ejOe3jqfcNEBbko",
                "customer": "cus_3VkUGLUbX7ANH5",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              }
            ]
          },
          "default_card": "card_103VkU225BGP9bWCrCY5I1FV",
          "subscription": {
            "id": "sub_3VkUMBG5GJ3uvY",
            "plan": {
              "interval": "month",
              "name": "myflix_base_plan",
              "created": 1392312654,
              "amount": 999,
              "currency": "usd",
              "id": "myflix_base",
              "object": "plan",
              "livemode": false,
              "interval_count": 1,
              "trial_period_days": null,
              "metadata": {}
            },
            "object": "subscription",
            "start": 1392611210,
            "status": "active",
            "customer": "cus_3VkUGLUbX7ANH5",
            "cancel_at_period_end": false,
            "current_period_start": 1392611210,
            "current_period_end": 1395030410,
            "ended_at": null,
            "trial_start": null,
            "trial_end": null,
            "canceled_at": null,
            "quantity": 1,
            "application_fee_percent": null,
            "discount": null
          }
        }
    http_version: 
  recorded_at: Mon, 17 Feb 2014 04:26:50 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_3VkUGLUbX7ANH5
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.9.9
      Authorization:
      - Bearer sk_test_e2Jyqc84D52dW381fNpkCo4i
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.9.9","lang":"ruby","lang_version":"2.0.0 p353 (2013-11-22)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19 22:22:27
        PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 17 Feb 2014 04:26:50 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2847'
      Connection:
      - keep-alive
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Credentials:
      - 'true'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1392611210,
          "id": "cus_3VkUGLUbX7ANH5",
          "livemode": false,
          "description": null,
          "email": "virgil_huel@klein.com",
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "count": 1,
            "url": "/v1/customers/cus_3VkUGLUbX7ANH5/subscriptions",
            "data": [
              {
                "id": "sub_3VkUMBG5GJ3uvY",
                "plan": {
                  "interval": "month",
                  "name": "myflix_base_plan",
                  "created": 1392312654,
                  "amount": 999,
                  "currency": "usd",
                  "id": "myflix_base",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {}
                },
                "object": "subscription",
                "start": 1392611210,
                "status": "active",
                "customer": "cus_3VkUGLUbX7ANH5",
                "cancel_at_period_end": false,
                "current_period_start": 1392611210,
                "current_period_end": 1395030410,
                "ended_at": null,
                "trial_start": null,
                "trial_end": null,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null
              }
            ]
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "cards": {
            "object": "list",
            "count": 1,
            "url": "/v1/customers/cus_3VkUGLUbX7ANH5/cards",
            "data": [
              {
                "id": "card_103VkU225BGP9bWCrCY5I1FV",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 1,
                "exp_year": 2015,
                "fingerprint": "9ejOe3jqfcNEBbko",
                "customer": "cus_3VkUGLUbX7ANH5",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              }
            ]
          },
          "default_card": "card_103VkU225BGP9bWCrCY5I1FV",
          "subscription": {
            "id": "sub_3VkUMBG5GJ3uvY",
            "plan": {
              "interval": "month",
              "name": "myflix_base_plan",
              "created": 1392312654,
              "amount": 999,
              "currency": "usd",
              "id": "myflix_base",
              "object": "plan",
              "livemode": false,
              "interval_count": 1,
              "trial_period_days": null,
              "metadata": {}
            },
            "object": "subscription",
            "start": 1392611210,
            "status": "active",
            "customer": "cus_3VkUGLUbX7ANH5",
            "cancel_at_period_end": false,
            "current_period_start": 1392611210,
            "current_period_end": 1395030410,
            "ended_at": null,
            "trial_start": null,
            "trial_end": null,
            "canceled_at": null,
            "quantity": 1,
            "application_fee_percent": null,
            "discount": null
          }
        }
    http_version: 
  recorded_at: Mon, 17 Feb 2014 04:26:50 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_3VkUGLUbX7ANH5/subscriptions
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.9.9
      Authorization:
      - Bearer sk_test_e2Jyqc84D52dW381fNpkCo4i
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.9.9","lang":"ruby","lang_version":"2.0.0 p353 (2013-11-22)","platform":"x86_64-darwin12.5.0","publisher":"stripe","uname":"Darwin
        MacBook-Air.local 13.0.0 Darwin Kernel Version 13.0.0: Thu Sep 19 22:22:27
        PDT 2013; root:xnu-2422.1.72~6/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 17 Feb 2014 04:26:51 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '929'
      Connection:
      - keep-alive
      Cache-Control:
      - no-cache, no-store
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "list",
          "count": 1,
          "url": "/v1/customers/cus_3VkUGLUbX7ANH5/subscriptions",
          "data": [
            {
              "id": "sub_3VkUMBG5GJ3uvY",
              "plan": {
                "interval": "month",
                "name": "myflix_base_plan",
                "created": 1392312654,
                "amount": 999,
                "currency": "usd",
                "id": "myflix_base",
                "object": "plan",
                "livemode": false,
                "interval_count": 1,
                "trial_period_days": null,
                "metadata": {}
              },
              "object": "subscription",
              "start": 1392611210,
              "status": "active",
              "customer": "cus_3VkUGLUbX7ANH5",
              "cancel_at_period_end": false,
              "current_period_start": 1392611210,
              "current_period_end": 1395030410,
              "ended_at": null,
              "trial_start": null,
              "trial_end": null,
              "canceled_at": null,
              "quantity": 1,
              "application_fee_percent": null,
              "discount": null
            }
          ]
        }
    http_version: 
  recorded_at: Mon, 17 Feb 2014 04:26:51 GMT
recorded_with: VCR 2.8.0
